Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/C13B.tmx
Source language: en_us
Languages: zh_cn

source: The 'Walking Dead' Season-Finale Report Card
zh_cn: 《行尸走肉》第二季完结成绩单

source: Was the second part of the zombie show's second season able to make up for its lousy first half?
zh_cn: 《行尸走肉》第二季后半部能弥补糟糕的前半部吗？

source: It's been an up-and-down year for The Walking Dead, which set ratings records even as it dealt with widely-publicized problems behind the camera.
zh_cn: 对于《行尸走肉》来说，这是颇为曲折的一年，本电视剧在受广泛宣传问题困扰的背景下，仍然创下了收视纪录。

source: Showrunner Frank Darabont left (or, depending on reports, was fired from) the series amid reports of budget cuts, leaving producer Glen Mazzara to take over the job for the second season's final six episodes.
zh_cn: 由于本片预算削减，本片的编剧及制片人弗兰克-德拉邦特(Frank Darabont)在本季中离开剧组（也有报道称，他是被解雇了），第二季剩下的六集全部制作拍摄工作交由格伦-马扎拉（Glen Mazzara）负责。

source: It was a tall order.
zh_cn: 这是一个艰巨的任务。

source: The off-camera tension was apparent in the slow, disappointing first half of The Walking Dead's second season, which drew widespread, justified criticism for poor dialogue and a meandering, wheel-spinning plot.
zh_cn: 本剧面临关机的紧张气氛也明显舒缓下来，《行尸走肉》第二季的前几集让观众们很失望，大家都批评这几集对话枯燥，故事情节温和拖沓，缺少刺激的镜头。

source: But it wasn't too late for the zombie series to be resurrected.
zh_cn: 但是这并不妨碍僵尸的重新复兴。

source: After The Walking Dead's midseason finale aired last November, I wrote an article titled "5 Ways to Fix The Walking Dead," outlining the series' most irritating flaws and describing potential solutions.
zh_cn: 去年11月本季剧中节束后，我写了一篇文章，题目为“5种方法使《行尸走肉》复活”，文章中我概述了本季最恼人的缺陷以及描述了可解决的办法。

source: Now that The Walking Dead's season finale, "Beside the Dying Fire," has aired, it's time to give the second season of AMC's most popular series its final report card.
zh_cn: 现在本季压轴戏已经上演了，“面对已经熄灭的火堆”，是时候让MAC最受欢迎的剧集交出满意的结局报告了。

source: Did the final six episodes of The Walking Dead's second season make up for the disappointing sophomore slump of its first seven?
zh_cn: 《行尸走肉》第二季后6集能弥补糟糕的前7集吗？

source: Stop repeating scenes Verdict: Improved The Walking Dead ran seven episodes before its midseason hiatus last November, but in retrospect there was really only enough story for two or three.
zh_cn: 1.停止重复的场景 结论：已经改进了 一直到去年11月的旺季暂休期，《行尸走肉》播完了第二季的前7集，但是回想剧情，前几集只需要1-2集就能演清楚。

source: The show was mired in a seemingly-endless search for Sophia, which required the plot to inch forward at a snail's pace to preserve its big reveal for the final moments of the midseason finale.
zh_cn: 剧情陷入了没完没了的寻找索菲娅的过程中，这就需要剧情以蜗牛的速度来发展，为本季最后结局大揭晓作铺垫。

source: To fill the dead time, each of the show's characters had a single, repetitive talking point, and major conflicts―Rick vs. Hershel, or Shane vs. Lori or Andrea vs. Dale―would be tabled and revisited each episode, without ever achieving any actual resolution.
zh_cn: 为了填补空载的时间，每一集的角色都有一个独立的、重复谈论点，以及一个主要冲突，包括瑞克VS.赫谢尔，肖恩VS.洛丽，或者安德利亚 VS. 戴尔，这些冲突在每一集中都会出现或者重复，在剧中从未得到真正的解决。

source: The Walking Dead still isn't perfect on this front―certain repetitive storylines (like Lori's apparent inability to keep track of Carl for more than eight consecutive seconds) continue to grate.
zh_cn: 《行尸走肉》在这方面依然是很不完美的，某些重复的故事情节在不断的升级（比如洛丽在超过连续8秒后，就跟不上卡尔的进度了）。

source: But there are promising signs that The Walking Dead's status quo is actually changing.
zh_cn: 但是也有令人鼓舞的迹象，本剧的现状正在逐渐改变。

source: Dale, whose whiny moralizing made him one of the show's more irritating characters, was killed off in the series' most intriguing deviation from its comic-book roots.
zh_cn: 戴尔，他唠叨的说教让他在其中一集成为了众矢之的，他的死与本剧的同名漫画中的描述有很大的出入，十分耐人寻味。

source: And Lori's horror at Rick's brutal confession in last night's finale, which ended with Rick conceding that he "wanted [Shane] dead," indicates a moral gulf growing between the couple that's far more interesting than another debate about raising a child in a zombie apocalypse.
zh_cn: 昨晚压轴戏中，洛丽对于瑞克的残酷自白感到恐惧，在本集未，瑞克自白他“想让肖恩死掉”，这表明这对夫妻间道德上的鸿沟越来越大，这远比争论如何在僵尸启示下抚养孩子更有趣。

source: Embrace the genre Verdict: Much improved
zh_cn: 2.不脱离本片的类型 结论：加强改进

source: The creative team behind The Walking Dead loves to wax rhapsodic about how the series' prime focus is its characters.
zh_cn: 《行尸走肉》背后的创意团队喜爱肆意狂想这个系列剧的主要焦点该如何聚集在人物上。

source: But let's acknowledge the real reason The Walking Dead is the top-rated cable drama for adults aged 18-49: zombies.
zh_cn: 但是我们要注意到本剧收视率最高的真正原因，本剧是为18-49岁的成年人准备的僵尸片。

source: After a tepid start to the season, the back half of offered several impressive zombie attacks, from Shane's standoff in a school bus in "Secrets" to last night's barn-burning assault by a massive zombie herd.
zh_cn: 本季开播后，一直不温不火，后半季才出现了一些令人印象深刻的僵尸攻击片段，从肖恩在校车中陷入僵局到昨晚的谷仓起火，一大群僵尸围攻。

source: It doesn't hurt that Greg Nicotero's special effects work continues to improve―seriously, compare the pilot's so-so zombie makeup to the rotting, shambling grotesqueries of recent episodes―and now that the group has lost its safe haven, the potential for exciting, horrific zombie attacks has grown exponentially higher.
zh_cn: 这并没有妨碍到格雷-尼克特若（Greg Nicotero）的特效工作的不断提高，说正经的，相比飞行员那马马虎虎的僵尸造型，现在这部剧中的腐烂、蹒跚怪诞的造型逼真多了。而现在，本剧中的团队正在失去他们的安全地带，刺激、恐怖的潜在僵尸攻击将成倍的增长。

source: But the most promising development by far is the appearance of Michonne, who rescued Andrea from death-by-zombie in last night's finale.
zh_cn: 但是到现在为止最有发展前途的就是米琼恩，她在昨晚最后一集中将安德里亚从僵尸口中救出。

source: The mysterious character, a fan-favorite of the comics, earned an appropriately Grand Guignol entrance: shrouded in a hood and wielding a katana, trailed by two "pet" zombies that she's disarmed in the most literal sense of the word.
zh_cn: 这个神秘的人物，也是本剧漫画迷最喜欢的角色，获得了一个在大基诺剧院式的入场，戴着面罩，挥舞着武士刀，后面跟着两个“宠物”僵尸，这样说来她真的不需要武器了。

source: Michonne (who will be played by Treme's Danai Gurira in The Walking Dead's third season) is way, way crazier than anything we've seen on The Walking Dead so far―and that's a good thing.
zh_cn: 米琼恩（在第三季中，这个角色将由来自瑞姆（Treme's 新奥尔良市附近的一个小镇）的达奈-谷瑞拉( Danai Gurira)来扮演 ），她是我们看《行尸走肉》到目前为止最最疯狂的角色，这是一件好事。

source: The Walking Dead shouldn't be all comic-book gore all the time, but it's nice to see the series balancing its soapier, more turgid side with the pulpier aspects of its source material.
zh_cn: 这部剧不用完全按照漫画里演，但是很高兴看到有这样的亮点，将原漫画中的粗略描写部分更细致的表现出来。

source: Develop characters through flashbacks Verdict: Needs improvement
zh_cn: 3.用倒叙的方法展现人物 结论：需要改进

source: Last night's finale technically opened with a flashback - showing the zombie herd's path from Atlanta to Hershel's farm―but that didn't exactly offer any more insight into the characters. Showrunner Glen Mazzara has repeatedly indicated in interviews that he's not interested in using flashbacks on The Walking Dead―even reiterating in a post-mortem about last night's finale that his sole plan for the series is "to propel the story forward."
zh_cn: 昨晚最后一集技术性的插入了倒叙，说明了僵尸群是从亚特兰大走到了赫谢尔的农庄，但是并没有对人物进行更深入的刻画，制作人格伦-马扎拉在采访中一再表示他并不喜欢在《行尸走肉》中使用倒叙，甚至在昨晚最后一集播出后重申他唯一的计划是“推动故事向前发展”。

source: But in the end, the problem isn't merely the lack of flashbacks; it's the feeling that none of these characters had lives before the zombie apocalypse.
zh_cn: 但是到最后，问题不仅仅是缺乏倒叙，让我们感觉这些人物在僵尸灾难之前，没有一个人是有生活的。

source: If Mazzara is determined not to use flashbacks, he can accomplish the same thing through dialogue.
zh_cn: 如果马扎拉下定决心不用倒叙，他可以通过对话达到同样的目的。

source: Dropping little details about the characters' pre-zombie pasts―like Dale's reference to the fact that Andrea was once a civil rights attorney―would make these two-dimensional characters feel at least 2.5-dimensional, and give us some reason to invest in barely fleshed-out characters like T-Dog.
zh_cn: 放弃剧中人物在僵尸爆发前的生活细节（比如戴尔提到安德里亚曾经是民权律师），使人感到人物的性格缺少鲜明，我们需要理由去投入了解像T-Dog这样不鲜明人物的性格。

source: Keep things moving Verdict: Much improved
zh_cn: 4.继续前行 结论：大为改进

source: Back in November, I wrote that it was "time to get off the farm and hit the road again." It took another six episodes (and another four months), but The Walking Dead finally said goodbye to the Greene farm in the most definitive way imaginable: overrunning it with zombies and burning it to the ground.
zh_cn: 早在11月，我就曾写到过“是时候离开农场再次上路了”，这需要另外6集来实现（需要另4个月），但是《行尸走肉》在本季未以一种绝对想像的到的方式对格林农场说再见：农场被僵尸占领，火焰彻底的燃烧。

source: After a full season, we're finally back on the road―and, from the looks of things, headed to the much more dynamic location of the prison next season.
zh_cn: 经过了整整一季，我们终于重返路途，在下一季将向更有活力的地点“监狱”前行。
